//Количество колонок игрового поля.
const COLUMNS_QUANTITY = 10

//Количество рядов игрового поля.
const ROWS_QUANTITY = 20

//Размер одного блока.
const BLOCK_SIZE = 30;

//Фигуры.
GAME_PIECE_SET = [
    //I
    [
        [0, 0, 0, 0], 
        [1, 1, 1, 1], 
        [0, 0, 0, 0], 
        [0, 0, 0, 0]
    ], 
    //J
    [
        [1, 0, 0], 
        [1, 1, 1], 
        [0, 0, 0]
    ], 
    //L
    [
        [0, 0, 1],
        [1, 1, 1],
        [0, 0, 0]
    ], 
    //O
    [
        [1, 1],
        [1, 1]
    ], 
    //S
    [
        [0, 1, 1],
        [1, 1, 0],
        [0, 0, 0]
    ], 
    //Z
    [
        [1, 1, 0],
        [0, 1, 1],
        [0, 0, 0]
    ], 
    //T
    [
        [0, 1, 0],
        [1, 1, 1],
        [0, 0, 0]
    ]
];

//Цвета для фигур.
COLORS = [
    'cyan', 
    'yellow', 
    'purple', 
    'green', 
    'red', 
    'blue', 
    'orange'
];

const STATISTICS = {
    //Количество очков.
    score: 0, 
    //Уровень сложности.
    level: 0, 
    //Количество собранных рядов.
    rows: 0, 
    //Для начисления баллов.
    bonus: 0
}

const TIME = { 
    initialTime: 0, 
    spentTime: 0, 
    level: 1000 
};

const LEVELS = {
    1: 900, 
    2: 800, 
    3: 700, 
    4: 600, 
    5: 500, 
    6: 400, 
    7: 300, 
    8: 200, 
    9: 100
}

const POINTS = {
    1: 100, 
    2: 300, 
    3: 500, 
    4: 800
}